# 最后跟列表一样，来一个实例，大家也可以多尝试，去把元组的各种玩法玩一遍。
#
name1 = ('一点水', '两点水', '三点水', '四点水', '五点水')

name2 = ('1点水', '2点水', '3点水', '4点水', '5点水')

name3 = ('1点水', '2点水', '3点水', '4点水', '5点水','一点水', '两点水', '三点水', '四点水', '范点水')
list1 = [1, 2, 3, 4, 5]
list2 = ['1点水', '2点水', '3点水', '4点水', '5点水','一点水', '两点水', '三点水', '四点水', '范点水']

# 计算元素个数
print(len(name1))
# 连接,两个元组相加
print(name1 + name2)
# 复制元组
print(name1 * 2)
# 元素是否存在 (name1 这个元组中是否含有一点水这个元素)
print('一点水' in name1)
# 元素的最大值
print(max(name2))
# 元素的最小值
print(min(name2))
# 将列表转换为元组
print(tuple(list1))

# 元素的最大值
print(max(name3))
# 元素的最小值
print(min(name3))
# 将列表转换为元组
print(tuple(list2))

